# .zsh_plugins.txt

# Zephyr plugins
# pick only the plugins you want and remove the rest
mattmc3/zephyr path:plugins/color
mattmc3/zephyr path:plugins/completion
# mattmc3/zephyr path:plugins/confd
mattmc3/zephyr path:plugins/directory
# mattmc3/zephyr path:plugins/editor
# mattmc3/zephyr path:plugins/environment
mattmc3/zephyr path:plugins/history
mattmc3/zephyr path:plugins/homebrew
mattmc3/zephyr path:plugins/macos
# mattmc3/zephyr path:plugins/prompt
mattmc3/zephyr path:plugins/utility
# mattmc3/zephyr path:plugins/zfunctions


# Other plugins
zdharma-continuum/fast-syntax-highlighting kind:defer
zsh-users/zsh-autosuggestions
zsh-users/zsh-history-substring-search

